app/Http/Controllers/AuthController.php

    public function logout()
    {
        $user = auth()->user();

        $livefeed = new Livefeeds();
        $livefeed->event = auth()->user()->username . ' has just signed out.';
        $livefeed->type = 'signout';
        $livefeed->save();
        $user->last_logoff = Carbon::now();
        $user->save();
---
insert into `livefeeds` (`event`, `type`, `id`, `updated_at`, `created_at`) values ('redvold has just signed out.', 'signout', 'de661238-c8b4-4cb3-94b4-1591c83c9f81', '2022-11-15 23:35:31', '2022-11-15 23:35:31')
update `users` set `last_logoff` = '2022-11-15 23:35:31', `users`.`updated_at` = '2022-11-15 23:35:31' where `id` = 'd4a75d23-cbad-4a3f-ba32-e8abda8dd8e1'