app/Http/Controllers/IndexController.php

    public function viewCategory($slug)
    {
        $category = Category::where('slug', $slug)->first();
---
select * from `categories` where `slug` = 'Services' limit 1

    public function viewSupport()
    {
        #Get auth user
        $user = auth()->user();

        return view('master.support', [
            'helpRequests' => $user->helprequests()->paginate(10),
        ]);
---
select count(*) as aggregate from `help_requests` where `help_requests`.`user_id` = 'd4a75d23-cbad-4a3f-ba32-e8abda8dd8e1' and `help_requests`.`user_id` is not null