app/Http/Controllers/UserController.php

select count(*) as aggregate from `transitions` where `transitions`.`user_id` = 'd4a75d23-cbad-4a3f-ba32-e8abda8dd8e1' and `transitions`.`user_id` is not null
---
    public function viewHistory()
    {
        #Get auth user
        $user = auth()->user();

        return view('user.history', [
            'transitions' => $user->transitions()->paginate(25),
        ]);

select count(*) as aggregate from `notifications` where `notifications`.`user_id` = 'd4a75d23-cbad-4a3f-ba32-e8abda8dd8e1' and `notifications`.`user_id` is not null
---
    public function viewNotifications()
    {
        #Get auth user
        $user = auth()->user();

        return view('user.notifications', [
            'notifications' => $user
                ->notifications()
                ->orderBy('created_at', 'DESC')
                ->paginate(25),
        ]);