app/Http/Requests/Auth/LoginRequest.php

select * from `users` where `username` = 'redvold' limit 1
---
    public function login()
    {
        session_start();
        $answer = $this->onionguard_answer;
        if (
            $_SESSION['times_0'] != $answer[1] - 2 ||
            $_SESSION['times_1'] != $answer[2] - 2 ||
            $_SESSION['times_2'] != $answer[3] - 2
        ) {
            session()->flash(
                'error',
                'You got the captcha Wrong - Are you a Robot?'
            );
            return redirect()->back();
        }

        #Get user
        $user = User::where('username', $this->username)->first();

update `users` set `last_login` = '2022-11-15 11:10:38', `users`.`updated_at` = '2022-11-15 11:10:38' where `id` = 'd4a75d23-cbad-4a3f-ba32-e8abda8dd8e1'
---

        #Update last site visit
        $user->last_login = Carbon::now();
        $user->save();

insert into `livefeeds` (`event`, `type`, `id`, `updated_at`, `created_at`) values ('redvold has just signed in.', 'signin', 'a250fb70-5ead-47db-8d57-7fb3801e72fe', '2022-11-15 11:10:39', '2022-11-15 11:10:39')
---
        $livefeed = new Livefeeds();
        $livefeed->event = $this->username . ' has just signed in.';
        $livefeed->type = 'signin';
        $livefeed->save();