app/Models/Bid.php

select * from `bids` where `slotnum` = 1 order by `updated_at` desc limit 1
---
    public static function firstBid($slotnum)
    {
        $bid = self::where('slotnum', $slotnum)
            ->orderBy('updated_at', 'DESC')
            ->first();