app/Models/Transition.php

    public static function getWithdrawHistory()
    {
        return self::where('action', 'Monero withdrawal')->get();
---
select * from `transitions` where `action` = 'Monero withdrawal'