app/Models/User.php

select count(*) as aggregate from `notifications` where `notifications`.`user_id` = 'd4a75d23-cbad-4a3f-ba32-e8abda8dd8e1' and `notifications`.`user_id` is not null and `read` = 0
---
    public function totalUnreadNotifications()
    {
        return $this->notifications()
            ->where('read', false)
            ->count();